<?php
/*
ЗАДАНИЕ 1
- Создайте переменную $name и присвойте ей строковое значение содержащее Ваше имя
- Создайте переменную $age и присвойте ей числовое значение содержащее Ваш возраст
*/
?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="ru" lang="ru">
<head>
	<title>Типы переменных</title>
	<meta http-equiv="Content-Type" content="text/html; charset=windows-1251" />
</head>
<body>
	<h1>Типы переменных</h1>
	<?php
	/*
	ЗАДАНИЕ 2
	- Выведите с помощью echo(или print) фразу "Меня зовут: ваше_имя", например: "Меня зовут: Игорь"
	- Выведите фразу "Мне ваш_возраст лет", например: "Мне 40 лет"
	- Измените код так, чтобы каждая фраза начиналась с новой строки
	- Измените код так, чтобы каждая фраза начиналась с новой строки в исходном HTML-коде(в Intrnet Explorer: Вид->Просмотр HTML-кода)
	*/
	?>
</body>
</html>
