<?php
	/*
	ЗАДАНИЕ 1
	- Создайте четыре константы:
		DB_HOST - для хранения адреса сервера баз данных mySQL
		DB_LOGIN - для хранения логина для соединения с сервером баз данных mySQL
		DB_PASSWORD - для хранения пароля для соединения с сервером баз данных mySQL
		DB_NAME - для хранения имени базы данных
	- Создайте переменную $count, которая будет хранить количество товаров в корзине пользователя и присвойте ей значение по умолчанию
	- Создайте константу ORDERS_LOG, которая будет хранить имя файла с личными данными пользователей
	- Установите соединение с сервером баз данных mySQL используя вышесозданные константы
	- Выберите на сервере для работы базу данных DB_NAME
	
	ЗАДАНИЕ 2
	- Выполните SQL-оператор на выборку количества товаров в корзине данного пользователя
	- Получите результат и сохраните его в значении переменной $count	
	*/
?>