/* --------------------------------------------------
---------------- О Г Л А В Л Е Н И Е ----------------
JavaScript.
3. Справочник объектов


		2. Boolean		| объект-обертка для значений типа boolean, для работы с этими типами
			Свои Свойства:
				> length					|	(стат.) длина, всегда = 1
				> prototype				| (стат.) св-во prototype функции-конструктора Boolean
			Свои Методы:
				>







-------------------------------------------------- */














/* --------------------------------------------------
---------------- И Н Ф О Р М А Ц И Я ----------------


Ссылки:


	> Описание объекта на developer.mozilla.org:
			https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Boolean?redirectlocale=en-US&redirectslug=JavaScript%2FReference%2FGlobal_Objects%2FBoolean






*****************************************************
Оглавление:

	>










*****************************************************


>








-------------------------------------------------- */

























